cask "font-fira-code-nerd-font"
cask "font-fira-sans"
cask "emacs-app"
cask "wezterm"
cask "nikitabobko/tap/aerospace"
brew "git"
brew "ripgrep"
brew "fd"
brew "cake"
brew "coreutils"
brew "libtool"
brew "texinfo"
brew "direnv"
brew "rbenv"
brew "shellcheck"
brew "editorconfig"
brew "eza"
brew "starship"
