tap "d12frosted/emacs-plus"

cask "font-fira-code-nerd-font"
cask "font-fira-sans"
cask "font-noto-emoji"
cask "font-noto-sans-symbols-2"

cask "wezterm"
cask "nikitabobko/tap/aerospace"

brew "emacs-plus@30"
brew "git"
brew "ripgrep"
brew "fd"
brew "cake"
brew "coreutils"
brew "libtool"
brew "texinfo"
brew "direnv"
brew "rbenv"
brew "shellcheck"
brew "editorconfig"
brew "eza"
brew "starship"
brew "ispell"
brew "jq"
brew "colima"
brew "docker"
brew "docker-buildx"
